#### TilePatternsBuiltIn Enumeration

---

|  |
| --- |
| See Also |

Revit's built-in tile patterns. See  TilePattern  .

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum TilePatternsBuiltIn ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration TilePatternsBuiltIn ``` |

| Visual C++ |
| --- |
| ``` public enum class TilePatternsBuiltIn ``` |

# Members

| Member name | Description |
| --- | --- |
| Rectangle |  |
| Triangle\_Bent |  |
| Rhomboid |  |
| Hexagon |  |
| HalfStep |  |
| ThirdStep |  |
| TriangleCheckerboard\_Bent |  |
| RectangleCheckerboard |  |
| RhomboidCheckerboard |  |
| TriangleStep\_Bent |  |
| Arrows |  |
| ZigZag |  |
| Octagon |  |
| OctagonRotate |  |
| Triangle\_Flat |  |
| TriangleCheckerboard\_Flat |  |

# See Also

Autodesk.Revit.DB Namespace